##  Project 3 - MISY408

**Load the Data into df dataframe**

In [1]:
import pandas as pb

df = pb.read_csv('project3data.csv')
df.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,SalesforceGender,Last Name,City and State,Work phone number,Score,column1,column2,column3
0,1,11/5/2018,"$26,000.00",32.0,No,Male,McCarty,Tampa:FL,573-333-0344,100P,NaN,NaN,NaN
1,2,11/1/2018,"$3,000.00",239.0,Yes,Male,Johnson,Tampa:FL,630-222-2475,100P,NaN,NaN,NaN
2,3,10/18/2018,"$13,000.00",138.0,Yes,Male,Bangs,Tampa:FL,229-444-4962,100P,NaN,NaN,NaN
3,4,10/1/2018,"$59,000.00",221.0,No,Male,Prater,Tampa:FL,740-555-0058,100P,NaN,NaN,NaN
4,5,6/14/2018,NaN,201.0,No,Male,Pearce,Tampa:FL,510-666-9668,100P,NaN,NaN,NaN

**Question 1:**

* Display the shape (number of rows and number of columns) of the dataframe

In [2]:
df.shape

(309, 13)

* Display the list of columns in the df dataframe

In [3]:
df.columns

Index(['Campaign ID', 'Date', 'Cost', 'SalesforceID', 'SpecialTraining',
       'SalesforceGender', 'Last Name', 'City and State', 'Work phone number',
       'Score', 'column1', 'column2', 'column3'],
      dtype='object')

* Create a deep copy of df and save it into df1

In [4]:
df1 = df.copy()

**Question 2: Remove Leading or Trailing Spaces for all columns**

In [5]:
df1.columns = df1.columns.str.strip()

**Question 3:**
* Drop column1, column2, and column3 from df1 dataftame
(Note: Use only one drop method to drop all three columns)

In [6]:
df1.drop(['column1','column2','column3'],axis=1,inplace = True)

* Display the shape (number of rows and number of columns) of  df1 dataframe

In [7]:
df1.shape

(309, 10)

**Question 4: Removing duplicate rows**

* Remove Duplicate rows from df1 dataframe

In [8]:
df1.drop_duplicates(inplace=True)

* Display the shape (number of rows and number of columns) of df1 dataframe

In [9]:
df1.shape

(306, 10)

**Question 5: Indentifying and removing missing Values**

* Show how many missing values we have in each column in df1 dataframe

In [10]:
df1.isnull().sum()

Campaign ID          0
Date                 3
Cost                 6
SalesforceID         1
SpecialTraining      7
SalesforceGender     5
Last Name            9
City and State       2
Work phone number    2
Score                3
dtype: int64

* Drop the rows that have missing values in the df1 dataframe

In [13]:
df1 = df1.dropna()

* Display the shape (number of rows and number of columns) of df1 dataframe

In [14]:
df1.shape

(271, 10)

**Question 6: Removing redundant spaces in the middle of String**

* Display unique values in 'City and State' column in df1 dataframe

In [15]:
df1['City and State'].unique()

array(['Tampa:FL', 'Tampa:FI', 'Chicago: IL', 'Chicago: LI', 'Newark:DD',
       'Newark:DE'], dtype=object)

From the above code's output, you noticed that for some values we have space after : and for some values we do not have space after : . You should make sure your data is consistent. Therefore, you should remove that space.

* In the following, type a code to remove redundant space in the middle of String in 'State and City' column in df1 dataframe

In [16]:
df1['City and State']= df1['City and State'].str.replace(' ', "")

* Display unique values in 'City and State' column in df1 dataframe to make sure the spaces are removed

In [18]:
df1['City and State'].unique()

array(['Tampa:FL', 'Tampa:FI', 'Chicago:IL', 'Chicago:LI', 'Newark:DD',
       'Newark:DE'], dtype=object)

**Question 7: Splitting data into two columns**

* Split 'City and State' column in df1 dataframe into two columns: City column and State column

In [19]:
df1[['City', 'State' ]] = df1['City and State'].str.split(':',expand = True)

* Display the first 5 rows of df1 dataframe

In [20]:
df1.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,SalesforceGender,Last Name,City and State,Work phone number,Score,City,State
0,1,11/5/2018,"$26,000.00",32.0,No,Male,McCarty,Tampa:FL,573-333-0344,100P,Tampa,FL
1,2,11/1/2018,"$3,000.00",239.0,Yes,Male,Johnson,Tampa:FL,630-222-2475,100P,Tampa,FL
2,3,10/18/2018,"$13,000.00",138.0,Yes,Male,Bangs,Tampa:FL,229-444-4962,100P,Tampa,FL
3,4,10/1/2018,"$59,000.00",221.0,No,Male,Prater,Tampa:FL,740-555-0058,100P,Tampa,FL
5,6,6/7/2018,"$3,000.00",125.0,Yes,Male,Clark,Tampa:FL,704-777-0613,100P,Tampa,FL

* Drop 'City and State' column from df1 dataframe

In [21]:
df1.drop(["City and State"], axis=1, inplace=True)

* Display the first 5 rows of df1 dataframe

In [22]:
df.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,SalesforceGender,Last Name,City and State,Work phone number,Score,column1,column2,column3
0,1,11/5/2018,"$26,000.00",32.0,No,Male,McCarty,Tampa:FL,573-333-0344,100P,NaN,NaN,NaN
1,2,11/1/2018,"$3,000.00",239.0,Yes,Male,Johnson,Tampa:FL,630-222-2475,100P,NaN,NaN,NaN
2,3,10/18/2018,"$13,000.00",138.0,Yes,Male,Bangs,Tampa:FL,229-444-4962,100P,NaN,NaN,NaN
3,4,10/1/2018,"$59,000.00",221.0,No,Male,Prater,Tampa:FL,740-555-0058,100P,NaN,NaN,NaN
4,5,6/14/2018,NaN,201.0,No,Male,Pearce,Tampa:FL,510-666-9668,100P,NaN,NaN,NaN

**Question 8: Fixing the SalesforceGender Column**

* Show unique values in SalesforceGender column in df1 dataframe

In [23]:
df1['SalesforceGender'].unique()

array(['Male', 'M', 'Female', 'F'], dtype=object)

* Create a new column 'FixedSalesforceGender' in df1 datafarme that:
    * Sets any Male, or M values to M
    * Sets any Female, or F values to F

In [24]:
df1.loc[(df1['SalesforceGender'] == 'Male') |  (df1['SalesforceGender'] == 'M'),'FixedSalesforceGender'] = "M"
df1.loc[(df1['SalesforceGender'] == 'Female') |  (df1['SalesforceGender'] == 'F'),'FixedSalesforceGender'] = "F"

* Display the first 5 rows of df1 dataframe

In [25]:
df1.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,SalesforceGender,Last Name,Work phone number,Score,City,State,FixedSalesforceGender
0,1,11/5/2018,"$26,000.00",32.0,No,Male,McCarty,573-333-0344,100P,Tampa,FL,M
1,2,11/1/2018,"$3,000.00",239.0,Yes,Male,Johnson,630-222-2475,100P,Tampa,FL,M
2,3,10/18/2018,"$13,000.00",138.0,Yes,Male,Bangs,229-444-4962,100P,Tampa,FL,M
3,4,10/1/2018,"$59,000.00",221.0,No,Male,Prater,740-555-0058,100P,Tampa,FL,M
5,6,6/7/2018,"$3,000.00",125.0,Yes,Male,Clark,704-777-0613,100P,Tampa,FL,M

* Create the frequency table for 'FixedSalesforceGender' using value_counts()

In [26]:
df1['FixedSalesforceGender'].value_counts()

M    259
F     12
Name: FixedSalesforceGender, dtype: int64

* Drop SalesforceGender column from df1 dataframe

In [27]:
df1.drop(['SalesforceGender'], axis=1, inplace=True)

* Display the first 5 rows of df1 dataframe

In [28]:
df1.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,Last Name,Work phone number,Score,City,State,FixedSalesforceGender
0,1,11/5/2018,"$26,000.00",32.0,No,McCarty,573-333-0344,100P,Tampa,FL,M
1,2,11/1/2018,"$3,000.00",239.0,Yes,Johnson,630-222-2475,100P,Tampa,FL,M
2,3,10/18/2018,"$13,000.00",138.0,Yes,Bangs,229-444-4962,100P,Tampa,FL,M
3,4,10/1/2018,"$59,000.00",221.0,No,Prater,740-555-0058,100P,Tampa,FL,M
5,6,6/7/2018,"$3,000.00",125.0,Yes,Clark,704-777-0613,100P,Tampa,FL,M

**Question 9: Extracting Numeric Data from Text**

* Replace Score column's value in df1 dataframe with the numeric part and convert it to integer
   * For example we replace 100P  with 100

In [29]:
df1['Score'] = df1['Score'].str.extract('(\d+)').astype(int)
df1['Score'].unique()

array([100,  98,  88,  83,  73,  70])

* Claulate the average Score

In [30]:
df1['Score'].mean()

89.07380073800738

**Question 10: Ensuring Data make sense and replacing it with valid values if needed**
* Read in the states.csv file into  dataframe called states.

In [32]:
states = pb.read_csv('states.csv')
states.head()

        STATE ABBREV
0     Alabama     AL
1      Alaska     AK
2     Arizona     AZ
3    Arkansas     AR
4  California     CA

* Use .loc and isin method to create a new column called ValidStatesCode. If the state in the df1 dataframe is valid, the value for ValidStateCode will be 1.  If the state in the df1 dataframe is invalid, the value for ValidStateCode will be 0

In [33]:
df1['ValidStatesCode'] = 0
df1.loc[df1['State'].isin(states['ABBREV']),'ValidStatesCode'] = 1

* Create a frequency table to display the number of valid states and the number of invalid states

In [34]:
df1['ValidStatesCode'].value_counts()

1    266
0      5
Name: ValidStatesCode, dtype: int64

* Subset the df1 dataframe to show State column and ValidStatesCode column for which ValidStatesCode's value is 0.

In [36]:
df1[['State','ValidStatesCode']].loc[df1['ValidStatesCode'] == 0]

    State  ValidStatesCode
77     FI                0
255    LI                0
260    LI                0
293    DD                0
300    DD                0

* In the following type three codes using .loc method to replace FI with FL, replace LI and IL,and replace DD with DE in the State column.

In [37]:
df1.loc[df1['State']=='FI','State']='FL'
df1.loc[df1['State']=='LI','State']='IL'
df1.loc[df1['State']=='DD','State']='DE'

* Display the first five rows of df1 dataframe

In [38]:
df1.head()

,Campaign ID,Date,Cost,SalesforceID,SpecialTraining,Last Name,Work phone number,Score,City,State,FixedSalesforceGender,ValidStatesCode
0,1,11/5/2018,"$26,000.00",32.0,No,McCarty,573-333-0344,100,Tampa,FL,M,1
1,2,11/1/2018,"$3,000.00",239.0,Yes,Johnson,630-222-2475,100,Tampa,FL,M,1
2,3,10/18/2018,"$13,000.00",138.0,Yes,Bangs,229-444-4962,100,Tampa,FL,M,1
3,4,10/1/2018,"$59,000.00",221.0,No,Prater,740-555-0058,100,Tampa,FL,M,1
5,6,6/7/2018,"$3,000.00",125.0,Yes,Clark,704-777-0613,100,Tampa,FL,M,1